cases/snappyHexMesh/transient/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/


// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type            sets;
libs            ("libsampling.so");

//writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   raw;

setConfig
{
    type    lineCell;
    axis    distance;  // x, y, z, xyz
    nPoints 30;
}

sets
(
    u0
    {
        $setConfig;
        start (0.0 0.0 -0.005 );
        end   (0.0 0.003 -0.005);
    }
    
    u3
    {
        $setConfig;
        start (0.003 0.0 -0.005 );
        end   (0.003 0.003 -0.005);
    }
    
    u6
    {
        $setConfig;
        start (0.006 0.0 -0.005 );
        end   (0.006 0.003 -0.005);
    }
    
);

fields  (U);

// ************************************************************************* //